CREATE DATABASE JDBC_EX;
USE JDBC_EX;

CREATE TABLE PRODUCT (	
	PRODUCT_CD 		VARCHAR(20),
	PRODUCT_NM 		VARCHAR(100),
	PRICE			INT,
	REG_DT			TIMESTAMP
);

# 실습을 위한 데이터 셋팅 예시
INSERT INTO PRODUCT VALUES ('P10001' , '게이밍마우스패드' , 24850 , '2020-02-11'),
						   ('P10002' , '조립 PC' , 1000000 , '2020-06-30'),
						   ('P10003' , '브리츠 2채널 스피커' , 30750 , '2020-08-08'),
						   ('P10004' , '기계식키보드 화이트(청축)', 38150 , '2020-12-30'),
						   ('P10005' , '기계식키보드 화이트(적축)', 38150 , '2020-12-30'),
						   ('P10006' , '기계식키보드 화이트(갈축)', 38150 , '2020-12-30'),
						   ('P10007' , '기계식키보드 화이트(흑축)', 95450 , '2020-12-30'),
						   ('P10008' , 'USB 8GB', 2870 , '2021-01-07'),
						   ('P10009' , 'USB 16GB' , 3510 , '2021-06-27'),
						   ('P10010' , 'USB 32GB' , 5100 , '2021-09-20'),
						   ('P10011' , 'USB 64GB' , 6200 , '2021-09-20'),
						   ('P10012' , 'USB 128GB' , 11400 , '2021-09-20'),
						   ('P10013' , '허브 USB' , 14900 , '2021-12-20'),
						   ('P10014' , '멀티탭 USB' , 10600 , '2021-12-20'),
						   ('P10015' , '연장케이블 USB' , 4950 , '2021-12-20');